thekevalian/CelesteHandheld/SW/SAMD21/Device/Include/SEGGER_SAMD21.h
/*********************************************************************
*                    SEGGER Microcontroller GmbH                     *
*                        The Embedded Experts                        *
**********************************************************************
*                                                                    *
*            (c) 2014 - 2022 SEGGER Microcontroller GmbH             *
*                                                                    *
*           www.segger.com     Support: support@segger.com           *
*                                                                    *
**********************************************************************
*                                                                    *
* All rights reserved.                                               *
*                                                                    *
* Redistribution and use in source and binary forms, with or         *
* without modification, are permitted provided that the following    *
* conditions are met:                                                *
*                                                                    *
* - Redistributions of source code must retain the above copyright   *
*   notice, this list of conditions and the following disclaimer.    *
*                                                                    *
* - Neither the name of SEGGER Microcontroller GmbH                  *
*   nor the names of its contributors may be used to endorse or      *
*   promote products derived from this software without specific     *
*   prior written permission.                                        *
*                                                                    *
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND             *
* CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,        *
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF           *
* MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE           *
* DISCLAIMED.                                                        *
* IN NO EVENT SHALL SEGGER Microcontroller GmbH BE LIABLE FOR        *
* ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR           *
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT  *
* OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;    *
* OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF      *
* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT          *
* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE  *
* USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH   *
* DAMAGE.                                                            *
*                                                                    *
*********************************************************************/

#ifndef __SEGGER_SAMD21_h
#define __SEGGER_SAMD21_h

#if defined(__SAMD21E15A__) || defined(__SAMD21E16A__) || defined(__SAMD21E17A__) || defined(__SAMD21E18A__) || defined(__SAMD21G15A__) || defined(__SAMD21G16A__) || defined(__SAMD21G17A__) || defined(__SAMD21G17AU__) || defined(__SAMD21G18A__) || defined(__SAMD21G18AU__) || defined(__SAMD21J15A__) || defined(__SAMD21J16A__) || defined(__SAMD21J17A__) || defined(__SAMD21J18A__)

#include "samd21a/include/sam.h"

#elif defined(__SAMD21E15B__) || defined(__SAMD21E15BU__) || defined(__SAMD21E16B__) || defined(__SAMD21E16BU__) || defined(__SAMD21G15B__) || defined(__SAMD21G16B__) || defined(__SAMD21J15B__) || defined(__SAMD21J16B__)

#include "samd21b/include/sam.h"

#elif defined(__SAMD21E15CU__) || defined(__SAMD21E16CU__)

#include "samd21c/include/sam.h"

#elif defined(__SAMD21E15L__) || defined(__SAMD21E16L__) || defined(__SAMD21E17L__) || defined(__SAMD21G15L__) || defined(__SAMD21G16L__) || defined(__SAMD21G17L__)

#include "samd21l/include/sam.h"

#elif defined(__SAMD21E17D__) || defined(__SAMD21E17DU__) || defined(__SAMD21G17D__) || defined(__SAMD21J17D__)

#include "samd21d/include/sam.h"

#endif

#endif
